In [1]:
import pandas as pd
import numpy as np

In [79]:
df=pd.DataFrame(np.random.randn(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])
df

       Column1   Column2   Column3   Column4
Row1 -0.005031 -0.139786 -0.189994  1.413173
Row2 -1.240834 -0.401718  0.270762 -2.589726
Row3  1.106041 -0.504800  0.229762 -0.091637
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [80]:
df.head()

       Column1   Column2   Column3   Column4
Row1 -0.005031 -0.139786 -0.189994  1.413173
Row2 -1.240834 -0.401718  0.270762 -2.589726
Row3  1.106041 -0.504800  0.229762 -0.091637
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [81]:
df.tail(2)

       Column1   Column2   Column3   Column4
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [82]:
a=df[['Column2', 'Column3']]
a

       Column2   Column3
Row1 -0.139786 -0.189994
Row2 -0.401718  0.270762
Row3 -0.504800  0.229762
Row4  2.101759 -0.433524
Row5 -2.190999  0.210069

In [83]:
type(a)

pandas.core.frame.DataFrame

In [84]:
df.loc[:,'Column1']

Row1   -0.005031
Row2   -1.240834
Row3    1.106041
Row4   -2.093376
Row5    2.249979
Name: Column1, dtype: float64

In [85]:
df.loc['Row1']

Column1   -0.005031
Column2   -0.139786
Column3   -0.189994
Column4    1.413173
Name: Row1, dtype: float64

In [86]:
df.loc[:,'Column1':'Column3']

       Column1   Column2   Column3
Row1 -0.005031 -0.139786 -0.189994
Row2 -1.240834 -0.401718  0.270762
Row3  1.106041 -0.504800  0.229762
Row4 -2.093376  2.101759 -0.433524
Row5  2.249979 -2.190999  0.210069

In [87]:
df.loc[:,'Column1':'Column3':2]

       Column1   Column3
Row1 -0.005031 -0.189994
Row2 -1.240834  0.270762
Row3  1.106041  0.229762
Row4 -2.093376 -0.433524
Row5  2.249979  0.210069

In [88]:
df.loc[:,'Column1':'Column3':2].values #converting dataframe to array

array([[-0.00503128, -0.18999387],
       [-1.24083412,  0.27076164],
       [ 1.10604132,  0.2297619 ],
       [-2.09337621, -0.43352351],
       [ 2.24997895,  0.21006904]])

In [89]:
a=df
a

       Column1   Column2   Column3   Column4
Row1 -0.005031 -0.139786 -0.189994  1.413173
Row2 -1.240834 -0.401718  0.270762 -2.589726
Row3  1.106041 -0.504800  0.229762 -0.091637
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [90]:
a.iloc[0,0]

-0.0050312784328144095

In [91]:
a.iloc[0,0]=None

In [92]:
a

       Column1   Column2   Column3   Column4
Row1       NaN -0.139786 -0.189994  1.413173
Row2 -1.240834 -0.401718  0.270762 -2.589726
Row3  1.106041 -0.504800  0.229762 -0.091637
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [93]:
a.isnull()

      Column1  Column2  Column3  Column4
Row1     True    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [94]:
a.isnull().sum()

Column1    1
Column2    0
Column3    0
Column4    0
dtype: int64

In [95]:
df

       Column1   Column2   Column3   Column4
Row1       NaN -0.139786 -0.189994  1.413173
Row2 -1.240834 -0.401718  0.270762 -2.589726
Row3  1.106041 -0.504800  0.229762 -0.091637
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [96]:
df.value_counts()

Column1    Column2    Column3    Column4
-2.093376   2.101759  -0.433524   1.102879    1
-1.240834  -0.401718   0.270762  -2.589726    1
 1.106041  -0.504800   0.229762  -0.091637    1
 2.249979  -2.190999   0.210069   0.140061    1
dtype: int64

In [97]:
df['Column1'].value_counts()

 2.249979    1
-1.240834    1
 1.106041    1
-2.093376    1
Name: Column1, dtype: int64

In [98]:
b=pd.DataFrame(np.ones([4,4]))
b

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0

In [99]:
b.value_counts()

0    1    2    3
1.0  1.0  1.0  1.0    4
dtype: int64

In [106]:
df.describe()

        Column1   Column2   Column3   Column4
count  4.000000  5.000000  5.000000  5.000000
mean   0.005452 -0.227109  0.017415 -0.005050
std    2.017218  1.532622  0.313351  1.577020
min   -2.093376 -2.190999 -0.433524 -2.589726
25%   -1.453970 -0.504800 -0.189994 -0.091637
50%   -0.067396 -0.401718  0.210069  0.140061
75%    1.392026 -0.139786  0.229762  1.102879
max    2.249979  2.101759  0.270762  1.413173

In [101]:
b=df

In [102]:
df.dropna(axis=1) #column dropped

       Column2   Column3   Column4
Row1 -0.139786 -0.189994  1.413173
Row2 -0.401718  0.270762 -2.589726
Row3 -0.504800  0.229762 -0.091637
Row4  2.101759 -0.433524  1.102879
Row5 -2.190999  0.210069  0.140061

In [103]:
df.dropna(axis=0) #row dropped

       Column1   Column2   Column3   Column4
Row2 -1.240834 -0.401718  0.270762 -2.589726
Row3  1.106041 -0.504800  0.229762 -0.091637
Row4 -2.093376  2.101759 -0.433524  1.102879
Row5  2.249979 -2.190999  0.210069  0.140061

In [104]:
df.corr()

          Column1   Column2   Column3   Column4
Column1  1.000000 -0.876649  0.637498  0.118232
Column2 -0.876649  1.000000 -0.806792  0.299386
Column3  0.637498 -0.806792  1.000000 -0.728007
Column4  0.118232  0.299386 -0.728007  1.000000

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  4 non-null      float64
 1   Column2  5 non-null      float64
 2   Column3  5 non-null      float64
 3   Column4  5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes